app/controllers/activities_controller.rb

  def index
    @activities = Activity.where(:private => false)
---
SELECT "activities".* FROM "activities" WHERE "activities"."private" = 'f'

  def show
    @activity = Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("created_at", "description", "due", "name", "private", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 13 Nov 2011 20:57:37 UTC +00:00], ["description", ""], ["due", nil], ["name", "go skydiving"], ["private", false], ["updated_at", Sun, 13 Nov 2011 20:57:37 UTC +00:00]]

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 5]]

  def add
    @activity = Activity.find(params[:id])
	@bucket_item = User.find(1).bucket_items.build(:activity_id => @activity.id)

	respond_to do |format|
      if @bucket_item.save
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "bucket_items" ("activity_id", "complete", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["activity_id", 1], ["complete", true], ["created_at", Sun, 13 Nov 2011 02:21:05 UTC +00:00], ["updated_at", Sun, 13 Nov 2011 02:21:05 UTC +00:00], ["user_id", 1]]