app/controllers/users_controller.rb

INSERT INTO "users" ("about", "created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["about", "hi my name is a"], ["created_at", Sun, 13 Nov 2011 01:22:08 UTC +00:00], ["email", "a@a.com"], ["updated_at", Sun, 13 Nov 2011 01:22:08 UTC +00:00], ["username", "a"]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def bucket_list
	@user = User.find(params[:id])

SELECT "bucket_items".* FROM "bucket_items" WHERE "bucket_items"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "bucket_items" SET "complete" = 't', "updated_at" = '2011-11-13 06:49:28.777747' WHERE "bucket_items"."id" = 8
---
  def check_activity
    @bucket_item = BucketItem.find(params[:id])

	respond_to do |format|
	  if @bucket_item.update_attribute(:complete, true)