app/views/activities/index.html.erb

SELECT "bucket_items".* FROM "bucket_items" WHERE "bucket_items"."activity_id" = 1 AND "bucket_items"."user_id" = 1 LIMIT 1
---

	<% if BucketItem.where(:activity_id => activity.id, :user_id => 1).exists? %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---

<%=  User.find(1).bucket_items %>